# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
# import libraries here
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
from scipy import stats

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [2]:
# your code here
temp = pd.read_csv('Temp_States.csv')

#### Print `temp`.

In [3]:
# your code here
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [7]:
# your code here
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [ ]:
"""
your comments here

In our dataset Temp_States we have two categorical columns what represent City and State names
and one float column with Temperature values

"""

#### Select the rows where state is New York.

In [8]:
# your code here
temp_ny = temp.loc[temp['State'] == 'New York']
temp_ny

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [9]:
# your code here
temp_ny['Temperature'].mean()

10.74074074074074

#### Which states and cities have a temperature above 15 degrees Celsius?

In [12]:
# your code here
temp_above15 = temp.loc[(temp['Temperature'] >= 15)]
temp_above15

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [13]:
# your code here
temp_above15['City']

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [14]:
# your code here
temp_between15to20 = temp.loc[(temp['Temperature'] >= 15) & (temp['Temperature'] <= 20)]
temp_between15to20

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
6    Newark   New Jersey    20.000000

#### Find the mean and standard deviation of the temperature of each state.

In [15]:
# your code here
states = temp['State'].unique()
states

array(['New York', 'Connecticut', 'New Jersey'], dtype=object)

In [17]:
temp_ny = temp.loc[temp['State'] == 'New York']
temp_ny

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

In [18]:
print('mean of temperaturen for New York is: ', temp_ny['Temperature'].mean())
print('standard deviation of temperature for New York is: ', np.std(temp_ny['Temperature']))

mean of temperaturen for New York is:  10.74074074074074
standard deviation of temperature for New York is:  6.64089669520041

In [19]:
temp_con = temp.loc[temp['State'] == 'Connecticut']
temp_con

         City        State  Temperature
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444

In [23]:
print('mean of temperaturen for Connecticut is: ', temp_con['Temperature'].mean())
print('standard deviation of temperature for Connecticut is: ', np.std(temp_con['Temperature']))

mean of temperaturen for Connecticut is:  15.833333333333332
standard deviation of temperature for Connecticut is:  1.3888888888888884

In [21]:
temp_nj = temp.loc[temp['State'] == 'New Jersey']
temp_nj

     City       State  Temperature
5  Treton  New Jersey    22.222222
6  Newark  New Jersey    20.000000

In [22]:
print('mean of temperaturen for New Jersey is: ', temp_nj['Temperature'].mean())
print('standard deviation of temperature for New Jersey is: ', np.std(temp_nj['Temperature']))

mean of temperaturen for New Jersey is:  21.11111111111111
standard deviation of temperature for New Jersey is:  1.1111111111111107

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [24]:
# your code here
employees = pd.read_csv('Employee.csv')
employees

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### Explore the data types of the `employees` dataframe. Comment your results.

In [25]:
# your code here
employees.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

In [ ]:
"""
your comments here

In our dataset Employees we have five categorical columns what represent Name, Departament, 
Name, Education, Gender and Title and two integer columns with Year and Salary values

"""

#### What's the average salary in this company?

In [27]:
# your code here
employees['Salary'].mean()

48.888888888888886

#### What's the highest salary?

In [28]:
# your code here
employees['Salary'].max()

70

#### What's the lowest salary?

In [29]:
# your code here
employees['Salary'].min()

30

#### Who are the employees with the lowest salary?

In [31]:
# your code here
print(employees.loc[employees['Salary'] == employees['Salary'].min()])

    Name Department Education Gender    Title  Years  Salary
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find all the information about an employee called David.

In [40]:
# your code here
david = employees.loc[employees['Name'] == 'David']
david

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [41]:
# your code here
david['Salary']

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [42]:
# your code here
print(print(employees.loc[employees['Title'] == 'associate']))

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60
None

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [43]:
# Method 1
# your code here
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [44]:
# Method 2
# your code here
employees2 = employees.iloc[0:3]
employees2

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [45]:
# your code here
employees_selected = employees.loc[(employees['Title'] == 'associate') & (employees['Salary'] >= 55)]
employees_selected

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [47]:
# your code here
employees.groupby(['Years']).mean()

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [48]:
# your code here
employees.groupby(['Title']).mean()

           Years     Salary
Title
VP          8.00  70.000000
analyst     2.25  32.500000
associate   4.00  56.666667

####  Find the salary quartiles.

In [50]:
# your code here
q1 = np.quantile(employees['Salary'], 0.25)
print('the first quartile is ', q1)

q2 = np.quantile(employees['Salary'], 0.50)
print('the second quartile is ', q2)

q3 = np.quantile(employees['Salary'], 0.75)
print('the third quartile is ', q3)

q4 = employees['Salary'].max()
print('the fourth quartile is ', q4)

the first quartile is  35.0
the second quartile is  55.0
the third quartile is  60.0
the fourth quartile is  70

#### Is the mean salary different per gender?

In [51]:
# your code here
employees.groupby(['Gender']).mean()

# yes, it is different - Males have greater avarage salary

        Years  Salary
Gender
F         4.0    47.5
M         4.2    50.0

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [52]:
# your code here
employees.groupby(['Title']).mean()

           Years     Salary
Title
VP          8.00  70.000000
analyst     2.25  32.500000
associate   4.00  56.666667

In [53]:
employees.groupby(['Title']).max()

             Name Department Education Gender  Years  Salary
Title
VP         Carlos         IT    Master      M      8      70
analyst     Sonia         IT    Master      M      4      35
associate  Samuel      Sales       Phd      M      7      60

In [54]:
employees.groupby(['Title']).min()

            Name Department Education Gender  Years  Salary
Title
VP           Ana         HR    Master      F      8      70
analyst    David         HR  Bachelor      F      1      30
associate    Eva         IT  Bachelor      F      2      55

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [62]:
# your code here

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [64]:
# your code here
orders = pd.read_csv('Orders.csv')
orders

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
397919,541904,581587,22613,2011,12,5,12,pack of 20 spaceboy napkins,12,2011-12-09 12:50:00,0.85,12680,France,10.20
397920,541905,581587,22899,2011,12,5,12,children's apron dolly girl,6,2011-12-09 12:50:00,2.10,12680,France,12.60
397921,541906,581587,23254,2011,12,5,12,childrens cutlery dolly girl,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397922,541907,581587,23255,2011,12,5,12,childrens cutlery circus parade,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397923,541908,581587,22138,2011,12,5,12,baking set 9 piece retrospot,3,2011-12-09 12:50:00,4.95,12680,France,14.85

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [65]:
# your code here
orders.dtypes

Unnamed: 0        int64
InvoiceNo         int64
StockCode        object
year              int64
month             int64
day               int64
hour              int64
Description      object
Quantity          int64
InvoiceDate      object
UnitPrice       float64
CustomerID        int64
Country          object
amount_spent    float64
dtype: object

In [68]:
orders.describe()

,Unnamed: 0,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,CustomerID,amount_spent
count,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000
mean,278465.221859,560617.126645,2010.934259,7.612537,3.614555,12.728247,13.021823,3.116174,15294.315171,22.394749
std,152771.368303,13106.167695,0.247829,3.416527,1.928274,2.273535,180.420210,22.096788,1713.169877,309.055588
min,0.000000,536365.000000,2010.000000,1.000000,1.000000,6.000000,1.000000,0.000000,12346.000000,0.000000
25%,148333.750000,549234.000000,2011.000000,5.000000,2.000000,11.000000,2.000000,1.250000,13969.000000,4.680000
50%,284907.500000,561893.000000,2011.000000,8.000000,3.000000,13.000000,6.000000,1.950000,15159.000000,11.800000
75%,410079.250000,572090.000000,2011.000000,11.000000,5.000000,14.000000,12.000000,3.750000,16795.000000,19.800000
max,541908.000000,581587.000000,2011.000000,12.000000,7.000000,20.000000,80995.000000,8142.750000,18287.000000,168469.600000

In [ ]:
"""
your comments here

In our dataset Orders we have four categorical columns what represent StockCode, Description,
InvoiceDate, Country and eight integer columns with Index, InvoiceNo, year, month, day, hour,
Quantity, CustomerID values and two float columns for UnitPrice, amount_spent. 
Central tendancy of all numeric columns we can see with orders.describe, but probably we will 
have interest only on values of Quantity, UnitPrice and amount_spent

"""

####  What is the average purchase price?

In [71]:
# your code here
orders['amount_spent'].mean()

22.39474850474768

#### What are the highest and lowest purchase prices?

In [72]:
# your code here
orders['amount_spent'].max()

168469.6

In [73]:
orders['amount_spent'].min() # in central tendancy we see that min price is 0, so somewhere 
                             # does exist purchase with amount spent 0

0.0

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [81]:
# your code here
spain = orders.loc[orders['Country'] == 'Spain']
spain_customer = spain.drop_duplicates(subset = ['CustomerID'])
spain_customer['CustomerID']

4250      12557
13974     17097
17368     12540
23288     12551
29804     12484
31390     12539
37428     12510
41390     12421
49687     12502
53374     12462
55336     12507
70307     12541
70657     12547
79781     12597
88639     12545
103106    12596
113099    12354
116553    12417
147386    12455
162904    12450
169315    12548
180343    12556
250565    12550
254077    12546
289129    12454
306993    12448
320987    12544
336389    12538
352636    12445
391792    12442
Name: CustomerID, dtype: int64

#### How many customers do we have in Spain?

In [85]:
# your code here
spain_customer['CustomerID'].count()

30

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [86]:
# your code here
orders_items = orders[['CustomerID', 'Quantity']]
orders_items

        CustomerID  Quantity
0            17850         6
1            17850         6
2            17850         8
3            17850         6
4            17850         6
...            ...       ...
397919       12680        12
397920       12680         6
397921       12680         4
397922       12680         4
397923       12680         3

[397924 rows x 2 columns]

In [90]:
orders_items = orders_items.groupby(['CustomerID']).sum()
orders_items.loc[orders_items['Quantity'] >= 50]

            Quantity
CustomerID
12346          74215
12347           2458
12348           2341
12349            631
12350            197
...              ...
18278             66
18281             54
18282            103
18283           1397
18287           1586

[4098 rows x 1 columns]

#### Select orders from Spain that include more than 50 items.

In [92]:
# your code here
spain_items = spain[['CustomerID', 'Quantity']]
spain_items = spain_items.groupby(['CustomerID']).sum()
spain_items.loc[spain_items['Quantity'] >= 50]

            Quantity
CustomerID
12354            530
12417            267
12421            484
12442            182
12445             62
12448            243
12450            128
12454           1006
12455            566
12462            536
12484           2191
12502            820
12507            905
12510            353
12538            191
12539           2067
12540           6685
12541            680
12544            136
12545            523
12546            633
12547            134
12550            569
12551            100
12556            358
12557           4384
12596            474
12597           2236
17097            459

#### Select all free orders.

In [93]:
# your code here
orders_free = orders.loc[orders['amount_spent'] == 0]
orders_free

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
6914,9302,537197,22841,2010,12,7,14,round cake tin vintage green,1,2010-12-05 14:02:00,0.0,12647,Germany,0.0
22539,33576,539263,22580,2010,12,4,14,advent calendar gingham sack,4,2010-12-16 14:36:00,0.0,16560,United Kingdom,0.0
25379,40089,539722,22423,2010,12,2,13,regency cakestand 3 tier,10,2010-12-21 13:45:00,0.0,14911,EIRE,0.0
29080,47068,540372,22090,2011,1,4,16,paper bunting retrospot,24,2011-01-06 16:41:00,0.0,13081,United Kingdom,0.0
29082,47070,540372,22553,2011,1,4,16,plasters in tin skulls,24,2011-01-06 16:41:00,0.0,13081,United Kingdom,0.0
34494,56674,541109,22168,2011,1,4,15,organiser wood antique white,1,2011-01-13 15:10:00,0.0,15107,United Kingdom,0.0
53788,86789,543599,84535B,2011,2,4,13,fairy cakes notebook a6 size,16,2011-02-10 13:08:00,0.0,17560,United Kingdom,0.0
85671,130188,547417,22062,2011,3,3,10,ceramic bowl with love heart design,36,2011-03-23 10:25:00,0.0,13239,United Kingdom,0.0
92875,139453,548318,22055,2011,3,3,12,mini cake stand hanging strawbery,5,2011-03-30 12:45:00,0.0,13113,United Kingdom,0.0
97430,145208,548871,22162,2011,4,1,14,heart garland rustic padded,2,2011-04-04 14:42:00,0.0,14410,United Kingdom,0.0
107192,157042,550188,22636,2011,4,4,18,childs breakfast set circus parade,1,2011-04-14 18:57:00,0.0,12457,Switzerland,0.0
128641,187613,553000,47566,2011,5,4,15,party bunting,4,2011-05-12 15:21:00,0.0,17667,United Kingdom,0.0
137127,198383,554037,22619,2011,5,5,14,set of 6 soldier skittles,80,2011-05-20 14:13:00,0.0,12415,Australia,0.0
194648,279324,561284,22167,2011,7,2,12,oval wall mirror diamante,1,2011-07-26 12:24:00,0.0,16818,United Kingdom,0.0
197173,282912,561669,22960,2011,7,4,17,jam making set with jars,11,2011-07-28 17:09:00,0.0,12507,Spain,0.0
199711,285657,561916,M,2011,8,1,11,manual,1,2011-08-01 11:44:00,0.0,15581,United Kingdom,0.0
208950,298054,562973,23157,2011,8,4,11,set of 6 nativity magnets,240,2011-08-11 11:42:00,0.0,14911,EIRE,0.0
223931,314745,564651,23270,2011,8,5,14,set of 2 ceramic painted hearts,96,2011-08-26 14:19:00,0.0,14646,Netherlands,0.0
223932,314746,564651,23268,2011,8,5,14,set of 2 ceramic christmas reindeer,192,2011-08-26 14:19:00,0.0,14646,Netherlands,0.0
223933,314747,564651,22955,2011,8,5,14,36 foil star cake cases,144,2011-08-26 14:19:00,0.0,14646,Netherlands,0.0
223934,314748,564651,21786,2011,8,5,14,polkadot rain hat,144,2011-08-26 14:19:00,0.0,14646,Netherlands,0.0
256263,358655,568158,PADS,2011,9,7,12,pads to match all cushions,1,2011-09-25 12:22:00,0.0,16133,United Kingdom,0.0
259399,361825,568384,M,2011,9,2,9,manual,1,2011-09-27 09:46:00,0.0,12748,United Kingdom,0.0
273926,379913,569716,22778,2011,10,4,8,glass cloche small,2,2011-10-06 08:17:00,0.0,15804,United Kingdom,0.0
286507,395529,571035,M,2011,10,4,12,manual,1,2011-10-13 12:50:00,0.0,12446,RSA,0.0
307092,420404,572893,21208,2011,10,3,14,pastel colour honeycomb fan,5,2011-10-26 14:36:00,0.0,18059,United Kingdom,0.0
319882,436428,574138,23234,2011,11,4,11,biscuit tin vintage christmas,216,2011-11-03 11:26:00,0.0,12415,Australia,0.0
320049,436597,574175,22065,2011,11,4,11,christmas pudding trinket pot,12,2011-11-03 11:47:00,0.0,14110,United Kingdom,0.0
320407,436961,574252,M,2011,11,4,13,manual,1,2011-11-03 13:24:00,0.0,12437,France,0.0
322279,439361,574469,22385,2011,11,5,11,jumbo bag spaceboy design,12,2011-11-04 11:55:00,0.0,12431,Australia,0.0
328385,446125,574879,22625,2011,11,1,13,red kitchen scales,2,2011-11-07 13:22:00,0.0,13014,United Kingdom,0.0
329006,446793,574920,22899,2011,11,1,16,children's apron dolly girl,1,2011-11-07 16:34:00,0.0,13985,United Kingdom,0.0
329007,446794,574920,23480,2011,11,1,16,mini lights woodland mushrooms,1,2011-11-07 16:34:00,0.0,13985,United Kingdom,0.0
334242,454463,575579,22437,2011,11,4,11,set of 9 black skull balloons,20,2011-11-10 11:49:00,0.0,13081,United Kingdom,0.0
334243,454464,575579,22089,2011,11,4,11,paper bunting vintage paisley,24,2011-11-10 11:49:00,0.0,13081,United Kingdom,0.0
352746,479079,577129,22464,2011,11,4,19,hanging metal heart lantern,4,2011-11-17 19:52:00,0.0,15602,United Kingdom,0.0
353097,479546,577168,M,2011,11,5,10,manual,1,2011-11-18 10:42:00,0.0,12603,Germany,0.0
354170,480649,577314,23407,2011,11,5,13,set of 2 trays home sweet home,2,2011-11-18 13:23:00,0.0,12444,Norway,0.0
358629,485985,577696,M,2011,11,1,11,manual,1,2011-11-21 11:57:00,0.0,16406,United Kingdom,0.0
370473,502122,578841,84826,2011,11,5,15,asstd design 3d paper stickers,12540,2011-11-25 15:57:00,0.0,13256,United Kingdom,0.0

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [98]:
# your code here
orders_lunch = orders[orders['Description'].str.contains('lunch bag')]
orders_lunch

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
93,93,536378,20725,2010,12,3,9,lunch bag red retrospot,10,2010-12-01 09:37:00,1.65,14688,United Kingdom,16.50
172,174,536385,22662,2010,12,3,9,lunch bag dolly girl design,10,2010-12-01 09:56:00,1.65,17420,United Kingdom,16.50
354,363,536401,22662,2010,12,3,11,lunch bag dolly girl design,1,2010-12-01 11:21:00,1.65,15862,United Kingdom,1.65
359,368,536401,20725,2010,12,3,11,lunch bag red retrospot,1,2010-12-01 11:21:00,1.65,15862,United Kingdom,1.65
360,369,536401,22382,2010,12,3,11,lunch bag spaceboy design,2,2010-12-01 11:21:00,1.65,15862,United Kingdom,3.30
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
397465,540436,581486,23207,2011,12,5,9,lunch bag alphabet design,10,2011-12-09 09:38:00,1.65,17001,United Kingdom,16.50
397713,541695,581538,20727,2011,12,5,11,lunch bag black skull.,1,2011-12-09 11:34:00,1.65,14446,United Kingdom,1.65
397714,541696,581538,20725,2011,12,5,11,lunch bag red retrospot,1,2011-12-09 11:34:00,1.65,14446,United Kingdom,1.65
397877,541862,581581,23681,2011,12,5,12,lunch bag red vintage doily,10,2011-12-09 12:20:00,1.65,17581,United Kingdom,16.50
397880,541865,581583,20725,2011,12,5,12,lunch bag red retrospot,40,2011-12-09 12:23:00,1.45,13777,United Kingdom,58.00

#### Select all `lunch bag` orders made in 2011.

In [101]:
# your code here
lunch_2011 = orders_lunch.loc[orders_lunch['year'] == 2011]
lunch_2011

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
26340,42678,540015,20725,2011,1,2,11,lunch bag red retrospot,10,2011-01-04 11:40:00,1.65,13319,United Kingdom,16.50
26341,42679,540015,20726,2011,1,2,11,lunch bag woodland,10,2011-01-04 11:40:00,1.65,13319,United Kingdom,16.50
26512,42851,540023,22382,2011,1,2,12,lunch bag spaceboy design,2,2011-01-04 12:58:00,1.65,15039,United Kingdom,3.30
26513,42852,540023,20726,2011,1,2,12,lunch bag woodland,1,2011-01-04 12:58:00,1.65,15039,United Kingdom,1.65
26860,43616,540098,22384,2011,1,2,15,lunch bag pink polkadot,1,2011-01-04 15:50:00,1.65,16241,United Kingdom,1.65
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
397465,540436,581486,23207,2011,12,5,9,lunch bag alphabet design,10,2011-12-09 09:38:00,1.65,17001,United Kingdom,16.50
397713,541695,581538,20727,2011,12,5,11,lunch bag black skull.,1,2011-12-09 11:34:00,1.65,14446,United Kingdom,1.65
397714,541696,581538,20725,2011,12,5,11,lunch bag red retrospot,1,2011-12-09 11:34:00,1.65,14446,United Kingdom,1.65
397877,541862,581581,23681,2011,12,5,12,lunch bag red vintage doily,10,2011-12-09 12:20:00,1.65,17581,United Kingdom,16.50
397880,541865,581583,20725,2011,12,5,12,lunch bag red retrospot,40,2011-12-09 12:23:00,1.45,13777,United Kingdom,58.00

#### Show the frequency distribution of the amount spent in Spain.

In [102]:
# your code here
frequency = pd.DataFrame(spain['amount_spent'].value_counts())
frequency

        amount_spent
15.00            186
17.70            122
19.80             99
17.40             86
10.20             76
...              ...
18.95              1
29.85              1
1.14               1
66.40              1
190.40             1

[316 rows x 1 columns]

#### Select all orders made in the month of August.

In [104]:
# your code here
orders_august = orders.loc[orders['month'] == 8]
orders_august

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
199475,285421,561904,22075,2011,8,1,8,6 ribbons elegant christmas,96,2011-08-01 08:30:00,1.45,17941,United Kingdom,139.20
199476,285422,561904,85049E,2011,8,1,8,scandinavian reds ribbons,156,2011-08-01 08:30:00,1.06,17941,United Kingdom,165.36
199477,285423,561905,21385,2011,8,1,9,ivory hanging decoration heart,24,2011-08-01 09:31:00,0.85,14947,United Kingdom,20.40
199478,285424,561905,84970L,2011,8,1,9,single heart zinc t-light holder,12,2011-08-01 09:31:00,0.95,14947,United Kingdom,11.40
199479,285425,561905,84970S,2011,8,1,9,hanging heart zinc t-light holder,12,2011-08-01 09:31:00,0.85,14947,United Kingdom,10.20
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
226483,320688,565067,22644,2011,8,3,17,ceramic cherry cake money bank,2,2011-08-31 17:16:00,1.45,15856,United Kingdom,2.90
226484,320689,565067,22645,2011,8,3,17,ceramic heart fairy cake money bank,2,2011-08-31 17:16:00,1.45,15856,United Kingdom,2.90
226485,320690,565067,22637,2011,8,3,17,piggy bank retrospot,2,2011-08-31 17:16:00,2.55,15856,United Kingdom,5.10
226486,320691,565067,22646,2011,8,3,17,ceramic strawberry cake money bank,2,2011-08-31 17:16:00,1.45,15856,United Kingdom,2.90
226487,320692,565067,22741,2011,8,3,17,funky diva pen,48,2011-08-31 17:16:00,0.85,15856,United Kingdom,40.80

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [131]:
# your code here
orders_august.groupby(['Country']).count()
# with value_counts() i receive an error: 
# 'DataFrameGroupBy' object has no attribute 'value_counts'
# so i used cont() - it gives me number of orders by each countries. 
# for more accurate view a could drop columns, but don't see it as necessary action
# because each column gives us same number anyway

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,amount_spent
Country,,,,,,,,,,,,,
Australia,107,107,107,107,107,107,107,107,107,107,107,107,107
Austria,88,88,88,88,88,88,88,88,88,88,88,88,88
Belgium,194,194,194,194,194,194,194,194,194,194,194,194,194
Canada,5,5,5,5,5,5,5,5,5,5,5,5,5
Channel Islands,140,140,140,140,140,140,140,140,140,140,140,140,140
Denmark,16,16,16,16,16,16,16,16,16,16,16,16,16
EIRE,593,593,593,593,593,593,593,593,593,593,593,593,593
Finland,61,61,61,61,61,61,61,61,61,61,61,61,61
France,569,569,569,569,569,569,569,569,569,569,569,569,569
Germany,795,795,795,795,795,795,795,795,795,795,795,795,795
Iceland,22,22,22,22,22,22,22,22,22,22,22,22,22
Israel,171,171,171,171,171,171,171,171,171,171,171,171,171
Italy,95,95,95,95,95,95,95,95,95,95,95,95,95
Malta,55,55,55,55,55,55,55,55,55,55,55,55,55
Netherlands,280,280,280,280,280,280,280,280,280,280,280,280,280
Norway,77,77,77,77,77,77,77,77,77,77,77,77,77
Poland,17,17,17,17,17,17,17,17,17,17,17,17,17
Portugal,41,41,41,41,41,41,41,41,41,41,41,41,41
Spain,252,252,252,252,252,252,252,252,252,252,252,252,252
Sweden,40,40,40,40,40,40,40,40,40,40,40,40,40
Switzerland,267,267,267,267,267,267,267,267,267,267,267,267,267
United Kingdom,23105,23105,23105,23105,23105,23105,23105,23105,23105,23105,23105,23105,23105
Unspecified,23,23,23,23,23,23,23,23,23,23,23,23,23

#### What's the  average amount of money spent by country?

In [121]:
# your code here
orders_spent = orders[['Country','amount_spent']]
orders_spent.groupby(['Country']).mean()

                      amount_spent
Country
Australia               116.895620
Austria                  25.624824
Bahrain                  32.258824
Belgium                  20.283772
Brazil                   35.737500
Canada                   24.280662
Channel Islands          27.340160
Cyprus                   22.134169
Czech Republic           33.069600
Denmark                  49.882474
EIRE                     36.687745
European Community       21.670833
Finland                  32.913985
France                   25.056827
Germany                  25.311562
Greece                   32.831172
Iceland                  23.681319
Israel                   29.119718
Italy                    23.064960
Japan                   116.561900
Lebanon                  37.641778
Lithuania                47.458857
Malta                    24.335625
Netherlands             120.798282
Norway                   33.736418
Poland                   22.226212
Portugal                 22.872702
RSA                      17.281207
Saudi Arabia             16.213333
Singapore                95.852658
Spain                    24.779521
Sweden                   85.096075
Switzerland              30.642752
USA                      20.002179
United Arab Emirates     27.974706
United Kingdom           20.625073
Unspecified              10.930615

#### What's the most expensive item?

In [127]:
# your code here
item = orders.loc[orders['UnitPrice'] == orders['UnitPrice'].max()]
item['Description']

118352    postage
Name: Description, dtype: object

#### What is the average amount spent per year?

In [128]:
# your code here
spent_year = orders[['year','amount_spent']]
spent_year.groupby(['year']).mean()

      amount_spent
year
2010     21.892733
2011     22.430074